tests/inteval.log

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:xmime5="http://www.w3.org/2005/05/xmlmime" xmlns:policnet="http://tempuri.org/policnet.xsd" xmlns:policynet="urn:policynet/v5"><SOAP-ENV:Body><policynet:publishMeterReadData><policynet:meterReadings><policynet:MR meterProgramId="6518" servicePointId="DEF456" utilitySerialNumber="DEF" wanMacAddress="1234567890"><policynet:R><policynet:Is readTimeLocal="2021-05-11T18:00:22"><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T18:00:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.253000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="244.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="40.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T17:45:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.661000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="245.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="41.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T17:30:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.109000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="245.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="41.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T17:15:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.115000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="245.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="41.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T17:00:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.194000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="245.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="41.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T16:45:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.211000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="246.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="41.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T16:30:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.630000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="245.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="41.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I><policynet:I lpSetNumber="1" rt="2021-05-11T18:00:22-07:00" ct="2021-05-12T01:01:27+00:00" t="2021-05-11T16:15:00"><policynet:c xsi:type="policynet:IntervalChan" u="kWh Delivered" v="0.987000" n="0"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="kVArh Lagging" v="0.000000" n="1"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="RMS Volts Phase A (Max)" v="247.000000" n="2"></policynet:c><policynet:c xsi:type="policynet:IntervalChan" u="Temperature Degrees C (Max)" v="42.000000" n="3"></policynet:c><policynet:s dst="true"></policynet:s></policynet:I></policynet:Is></policynet:R></policynet:MR></policynet:meterReadings></policynet:publishMeterReadData></SOAP-ENV:Body></SOAP-ENV:Envelope>